src/cf/InformationRegisters/СообщенияДляАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СообщенияДляАрхива</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Comment>Текст JSON в виде хранилища значения</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СообщенияДляАрхива/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает новое сообщение.
//
// Параметры:
//  ИдентификаторСообщения - Строка - строковый идентификатор сообщения.
//  ТелоСообщения - Произвольный - тело создаваемого сообщения.
//
Процедура Добавить(ИдентификаторСообщения, Знач ТелоСообщения) Экспорт
	
	Если ТипЗнч(ТелоСообщения) <> Тип("ХранилищеЗначения") Тогда
		ТелоСообщения = Новый ХранилищеЗначения(ТелоСообщения);
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ТелоСообщения = ТелоСообщения;
	Запись.ДатаСоздания = ТекущаяДатаСеанса();
	
	Запись.Записать();
	
КонецПроцедуры

// Отмечает сообщение как отправленное.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор в виде строки.
//
Процедура ОтметитьОтправку(ИдентификаторСообщения) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось отметить отправку сообщения ""%1"": запись не найдена'"),
			ИдентификаторСообщения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Запись.ДатаОтправки = ТекущаяДатаСеанса();
	Запись.ТекстОшибки = "";
	Запись.Записать();
	
КонецПроцедуры

// Фиксирует информацию о неудачной попытке отправки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор в виде строки.
//
Процедура ЗафиксироватьНеудачнуюПопытку(ИдентификаторСообщения, ТекстОшибки) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
